# Chapter 6

Pandas is a Python package that provides fast, flexible and expressive data structures designed to make working with "relational" and "labeled" data easy and intuitive. It aims to be the foundational building block for doing practical, real-world data analysis in Python. It also has the broader purpose of being the most powerful and flexible open source data analysis/manipulation tool available in any language.

## Learning Goals

- `pandas` Basics
- `pandas` Series
- Dataframe Definition
- Dataframe Filtering Operations
- Dataset Reading Methods
- Groupby Operator
- Dataframe Operation

## Authors

- Mert Candar, mccandar@gmail.com
- Aras Kahraman, aras.kahraman@hotmail.com

## Learning Curve Boosters


## The Goal



## Alternatives



## Why Choose `pandas`

Pandas is one of the most important libraries of the Python programming language. With Pandas, data reading, data preprocessing and data cleaning stages are done in a data science project. Before starting analysis such as machine learning or deep learning, it is very important to make the data suitable for analysis.

### Pandas Series

In [3]:
import numpy as np
import pandas as pd

In [5]:
labels_list = ["Dave","Oliver","Jane","Bobby","Sarah"]

In [6]:
data_list = [10,20,30,40,50]

In [7]:
pd.Series(data = data_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
pd.Series(data = data_list,index = labels_list)

Dave      10
Oliver    20
Jane      30
Bobby     40
Sarah     50
dtype: int64

In [9]:
array1 = np.array([10,20,30,40,50])

In [10]:
pd.Series(data = array1)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [11]:
pd.Series(data = array1,index = labels_list)

Dave      10
Oliver    20
Jane      30
Bobby     40
Sarah     50
dtype: int32

In [12]:
pd.Series(data = labels_list,index = array1)

10      Dave
20    Oliver
30      Jane
40     Bobby
50     Sarah
dtype: object

In [13]:
pd.Series(data = array1,index = ["A","B","C","D","E"])

A    10
B    20
C    30
D    40
E    50
dtype: int32

In [14]:
datadict = {"Dave":30,"Jane":80,"Oliver":60}

In [15]:
pd.Series(datadict)

Dave      30
Jane      80
Oliver    60
dtype: int64

In [16]:
browser2015 = pd.Series([8,20,15],["Safari","Chrome","Firefox"])

In [17]:
browser2016 = pd.Series([4,12,19],["Safari","Chrome","Firefox"])

In [18]:
browser2015

Safari      8
Chrome     20
Firefox    15
dtype: int64

In [19]:
browser2016

Safari      4
Chrome     12
Firefox    19
dtype: int64

In [20]:
browser2015 + browser2016

Safari     12
Chrome     32
Firefox    34
dtype: int64

In [21]:
stck2017 = pd.Series([5,10,14,20],["PC","TV","PS","Phone"]) # Google analitics examples

In [22]:
stck2018 = pd.Series([2,12,12,6],["PC","TV","Notebook","Phone"])

In [23]:
stck2017

PC        5
TV       10
PS       14
Phone    20
dtype: int64

In [24]:
stck2018

PC           2
TV          12
Notebook    12
Phone        6
dtype: int64

In [25]:
stck2017["PC"]

5

In [26]:
stck2018["PC"]

2

In [27]:
stck2017 + stck2018

Notebook     NaN
PC           7.0
PS           NaN
Phone       26.0
TV          22.0
dtype: float64

In [28]:
total_stock = stck2017 + stck2018

In [29]:
total_stock

Notebook     NaN
PC           7.0
PS           NaN
Phone       26.0
TV          22.0
dtype: float64

In [30]:
total_stock["PC"]

7.0

In [31]:
total_stock["Phone"]

26.0

In [32]:
total_stock["Notebook"]

nan

In [33]:
total_stock["PS"]

nan

### Dataframe Definition

In [34]:
#from numpy.random import randn
#import numpy as np

np.random.randn()

-0.6379090400214278

In [35]:
np.random.randn(3,3) # <--- randn(3,3) convert this to long version

array([[ 0.56235359, -0.34702233, -0.66437837],
       [-0.32460382,  1.2343441 , -2.34765195],
       [ 0.85476397, -0.28556766, -0.39191387]])

In [36]:
df = pd.DataFrame(np.random.randn(3,3), index = ["user_1","user_2","user_3"], columns = ["Basket Items","Purchased Count","Purchased Total"])

In [37]:
df

        Basket Items  Purchased Count  Purchased Total
user_1      1.759528         1.921721        -1.641127
user_2     -0.299227        -0.725320         1.182859
user_3      1.018493        -1.166353        -1.848561

In [38]:
df["Basket Items"]

user_1    1.759528
user_2   -0.299227
user_3    1.018493
Name: Basket Items, dtype: float64

In [39]:
df[["Basket Items","Purchased Count"]]

        Basket Items  Purchased Count
user_1      1.759528         1.921721
user_2     -0.299227        -0.725320
user_3      1.018493        -1.166353

In [40]:
df["Time on Page"] = pd.Series(np.random.randn(3), index = ["user_1","user_2","user_3"])

In [41]:
df

        Basket Items  Purchased Count  Purchased Total  Time on Page
user_1      1.759528         1.921721        -1.641127      0.726341
user_2     -0.299227        -0.725320         1.182859      0.805003
user_3      1.018493        -1.166353        -1.848561     -1.806511

In [42]:
df

        Basket Items  Purchased Count  Purchased Total  Time on Page
user_1      1.759528         1.921721        -1.641127      0.726341
user_2     -0.299227        -0.725320         1.182859      0.805003
user_3      1.018493        -1.166353        -1.848561     -1.806511

In [43]:
df.drop("user_1")

        Basket Items  Purchased Count  Purchased Total  Time on Page
user_2     -0.299227        -0.725320         1.182859      0.805003
user_3      1.018493        -1.166353        -1.848561     -1.806511

In [44]:
df.drop("Basket Items")

KeyError: "['Basket Items'] not found in axis"

In [45]:
df.drop("Basket Items",axis=1)

        Purchased Count  Purchased Total  Time on Page
user_1         1.921721        -1.641127      0.726341
user_2        -0.725320         1.182859      0.805003
user_3        -1.166353        -1.848561     -1.806511

In [46]:
df # not changed

        Basket Items  Purchased Count  Purchased Total  Time on Page
user_1      1.759528         1.921721        -1.641127      0.726341
user_2     -0.299227        -0.725320         1.182859      0.805003
user_3      1.018493        -1.166353        -1.848561     -1.806511

In [47]:
df.drop("Basket Items", axis = 1, inplace = True)

In [48]:
df

        Purchased Count  Purchased Total  Time on Page
user_1         1.921721        -1.641127      0.726341
user_2        -0.725320         1.182859      0.805003
user_3        -1.166353        -1.848561     -1.806511

In [49]:
df[["Purchased Count","Purchased Total"]]

        Purchased Count  Purchased Total
user_1         1.921721        -1.641127
user_2        -0.725320         1.182859
user_3        -1.166353        -1.848561

In [2]:
df["Column5"] = df["Column1"] + df["Column2"] + df["Column3"]

NameError: name 'df' is not defined

#### `loc` & `iloc`

In [51]:
df.loc["user_1"]

Purchased Count    1.921721
Purchased Total   -1.641127
Time on Page       0.726341
Name: user_1, dtype: float64

In [52]:
df.loc["user_1","Purchased Count"]

1.921720564790633

In [53]:
df.loc["user_2","Purchased Total"]

1.1828586419078262

In [54]:
df.loc[["user_1","user_2"]]

        Purchased Count  Purchased Total  Time on Page
user_1         1.921721        -1.641127      0.726341
user_2        -0.725320         1.182859      0.805003

In [55]:
df.loc[["user_1","user_2"],["Purchased Count","Purchased Total"]]

        Purchased Count  Purchased Total
user_1         1.921721        -1.641127
user_2        -0.725320         1.182859

In [57]:
df.iloc[0] # index 0 --> user_1

Purchased Count    1.921721
Purchased Total   -1.641127
Time on Page       0.726341
Name: user_1, dtype: float64

In [58]:
df.iloc[1]

Purchased Count   -0.725320
Purchased Total    1.182859
Time on Page       0.805003
Name: user_2, dtype: float64

In [70]:
df.iloc[[0, 1]]

        Purchased Count  Purchased Total  Time on Page
user_1         0.474830         0.287919      0.137311
user_2        -2.566771        -0.188238      1.186876

In [61]:
df.iloc[:,0]

user_1    0.474830
user_2   -2.566771
user_3    1.256624
Name: Purchased Count, dtype: float64

In [62]:
df.iloc[:,1]

user_1    0.287919
user_2   -0.188238
user_3    0.997207
Name: Purchased Total, dtype: float64

In [63]:
df.iloc[:,2]

user_1    0.137311
user_2    1.186876
user_3   -0.817835
Name: Time on Page, dtype: float64

In [64]:
df.iloc[:,-1]

user_1    0.137311
user_2    1.186876
user_3   -0.817835
Name: Time on Page, dtype: float64

### Dataframe Filtering Operations

In [17]:
x = pd.Series([6,1,2,4,1,12,314,5,6,34,23,23,13214,1])

In [73]:
df["Column1"] > -1

A     True
B    False
C     True
Name: Column1, dtype: bool

In [74]:
df[df["Column1"] > -1]

    Column1   Column2   Column3   Column4
A  1.556125 -0.516689  0.610544 -0.089217
C -0.096350 -0.538581 -0.365965  1.042605

In [81]:
df["Column3"] < 0

A    False
B     True
C     True
Name: Column3, dtype: bool

In [82]:
df[df["Column3"] < 0]

   Column1   Column2   Column3   Column4
B -1.00177  1.414081 -1.731494  0.025001
C -0.09635 -0.538581 -0.365965  1.042605

In [83]:
df[(df["Column1"] > -1) & (df["Column3"] < 0)]

   Column1   Column2   Column3   Column4
C -0.09635 -0.538581 -0.365965  1.042605

In [84]:
df[(df["Column1"] > -1) | (df["Column3"] < 0)]

    Column1   Column2   Column3   Column4
A  1.556125 -0.516689  0.610544 -0.089217
B -1.001770  1.414081 -1.731494  0.025001
C -0.096350 -0.538581 -0.365965  1.042605

In [59]:
df.loc[df['Purchased Count'] >= 0.47, ['Purchased Total']]

        Purchased Total
user_1        -1.641127

In [67]:
df

    Column1   Column2   Column3   Column4
A  1.556125 -0.516689  0.610544 -0.089217
B -1.001770  1.414081 -1.731494  0.025001
C -0.096350 -0.538581 -0.365965  1.042605

In [68]:
df > -1

   Column1  Column2  Column3  Column4
A     True     True     True     True
B    False     True    False     True
C     True     True     True     True

In [69]:
df[df > -1]

    Column1   Column2   Column3   Column4
A  1.556125 -0.516689  0.610544 -0.089217
B       NaN  1.414081       NaN  0.025001
C -0.096350 -0.538581 -0.365965  1.042605

In [70]:
df[df > 0]

    Column1   Column2   Column3   Column4
A  1.556125       NaN  0.610544       NaN
B       NaN  1.414081       NaN  0.025001
C       NaN       NaN       NaN  1.042605

In [71]:
df

    Column1   Column2   Column3   Column4
A  1.556125 -0.516689  0.610544 -0.089217
B -1.001770  1.414081 -1.731494  0.025001
C -0.096350 -0.538581 -0.365965  1.042605

In [72]:
df["Column1"]

A    1.556125
B   -1.001770
C   -0.096350
Name: Column1, dtype: float64

#### Index Change

In [86]:
df

    Column1   Column2   Column3   Column4
A  1.556125 -0.516689  0.610544 -0.089217
B -1.001770  1.414081 -1.731494  0.025001
C -0.096350 -0.538581 -0.365965  1.042605

In [88]:
df["Column5"] = ["newvalue1","newvalue2","newvalue3"]

In [89]:
df

    Column1   Column2   Column3   Column4    Column5
A  1.556125 -0.516689  0.610544 -0.089217  newvalue1
B -1.001770  1.414081 -1.731494  0.025001  newvalue2
C -0.096350 -0.538581 -0.365965  1.042605  newvalue3

In [ ]:
df.set_index("Column5")

In [93]:
df

    Column1   Column2   Column3   Column4    Column5
A  1.556125 -0.516689  0.610544 -0.089217  newvalue1
B -1.001770  1.414081 -1.731494  0.025001  newvalue2
C -0.096350 -0.538581 -0.365965  1.042605  newvalue3

In [94]:
df = df.set_index("Column5")

In [95]:
df

            Column1   Column2   Column3   Column4
Column5
newvalue1  1.556125 -0.516689  0.610544 -0.089217
newvalue2 -1.001770  1.414081 -1.731494  0.025001
newvalue3 -0.096350 -0.538581 -0.365965  1.042605

In [96]:
df.index.names # Index names

FrozenList(['Column5'])

### Dataframe Operations

In [8]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6,7],
    "Column2":[100,100,200,300,300,100,300],
    "Column3":["Trendyol","Hepsiburada","N11","Amazon","Gittigidiyor","Çiçek Sepeti","Alınıyor"]
})

In [9]:
df

   Column1  Column2       Column3
0        1      100      Trendyol
1        2      100   Hepsiburada
2        3      200           N11
3        4      300        Amazon
4        5      300  Gittigidiyor
5        6      100  Çiçek Sepeti
6        7      300      Alınıyor

In [10]:
df.head()

   Column1  Column2       Column3
0        1      100      Trendyol
1        2      100   Hepsiburada
2        3      200           N11
3        4      300        Amazon
4        5      300  Gittigidiyor

In [11]:
df["Column2"].unique()

array([100, 200, 300], dtype=int64)

In [12]:
df["Column2"].nunique()

3

In [13]:
df["Column2"].value_counts()

100    3
300    3
200    1
Name: Column2, dtype: int64

In [14]:
df[(df["Column1"] > 2) & (df["Column2"] == 300)]

   Column1  Column2       Column3
3        4      300        Amazon
4        5      300  Gittigidiyor
6        7      300      Alınıyor

In [15]:
def times3(x):    # Daha komplike işlemleri düşün
    return x * 3

In [16]:
#def times3(x):    # Daha komplike işlemleri düşün
    #if x<3:
        #pass
   # else:
        #for.......

In [21]:
column_names = ['Column1','Column2','Column3']
def addition(x):    # Daha komplike işlemleri düşün
    if x<300:
        pass
    else:
        for x in column_names:
            x+500

In [22]:
df["Column2"].apply(addition)

KeyError: 'Column2'

In [19]:
df = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'age': [25,26,27]
})

candidate_names = ['name','gender','age']

for name in candidate_names:
    if name in df.columns.values:
        print('"{}" is a column name'.format(name))

"name" is a column name
"age" is a column name

In [20]:
df["Column2"].apply(times3)

KeyError: 'Column2'

In [52]:
df

   Column1  Column2       Column3
0        1      100      Trendyol
1        2      100   Hepsiburada
2        3      200           N11
3        4      300        Amazon
4        5      300  Gittigidiyor
5        6      100  Çiçek Sepeti
6        7      300      Alınıyor

In [53]:
df["Column2"] = df["Column2"].apply(times3)

In [54]:
df

   Column1  Column2       Column3
0        1      300      Trendyol
1        2      300   Hepsiburada
2        3      600           N11
3        4      900        Amazon
4        5      900  Gittigidiyor
5        6      300  Çiçek Sepeti
6        7      900      Alınıyor

In [55]:
df.drop("Column1",axis = 1, inplace = True)

In [56]:
df

   Column2       Column3
0      300      Trendyol
1      300   Hepsiburada
2      600           N11
3      900        Amazon
4      900  Gittigidiyor
5      300  Çiçek Sepeti
6      900      Alınıyor

In [57]:
df.columns

Index(['Column2', 'Column3'], dtype='object')

In [58]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [59]:
df.index.names

FrozenList([None])

In [60]:
len(df.index)

7

In [61]:
df

   Column2       Column3
0      300      Trendyol
1      300   Hepsiburada
2      600           N11
3      900        Amazon
4      900  Gittigidiyor
5      300  Çiçek Sepeti
6      900      Alınıyor

In [62]:
df.sort_values("Column2")

   Column2       Column3
0      300      Trendyol
1      300   Hepsiburada
5      300  Çiçek Sepeti
2      600           N11
3      900        Amazon
4      900  Gittigidiyor
6      900      Alınıyor

In [23]:
df = pd.DataFrame({
    "Day" : ["Friday","Tuesday","Sunday","Friday","Tuesday","Sunday","Friday","Tuesday","Sunday"],
    "Site":["N11","N11","N11","Hepsiburada","Hepsiburada","Hepsiburada","Trendyol","Trendyol","Trendyol"],
    "Customer":[100,250,500,200,600,800,300,700,750]
})

In [24]:
df

       Day         Site  Customer
0   Friday          N11       100
1  Tuesday          N11       250
2   Sunday          N11       500
3   Friday  Hepsiburada       200
4  Tuesday  Hepsiburada       600
5   Sunday  Hepsiburada       800
6   Friday     Trendyol       300
7  Tuesday     Trendyol       700
8   Sunday     Trendyol       750

In [76]:
df.pivot_table(index = "Site",columns ="Day",values = "Customer")

Day          Friday  Sunday  Tuesday
Site
Hepsiburada     200     800      600
N11             100     500      250
Trendyol        300     750      700

In [77]:
df.pivot_table(index = "Day",columns ="Site",values = "Customer")

Site     Hepsiburada  N11  Trendyol
Day
Friday           200  100       300
Sunday           800  500       750
Tuesday          600  250       700

### Dataset Reading Methods

In [4]:
dataset = pd.read_csv("C:/Users/PC/Desktop/USvideos.csv")

In [5]:
dataset

,video_id,trending_date,title,channel_title,category_id,publish_time,tags,views,likes,dislikes,comment_count,thumbnail_link,comments_disabled,ratings_disabled,video_error_or_removed,description
0,2kyS6SvSYSE,17.14.11,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,2017-11-13T17:13:01.000Z,SHANtell martin,748374,57527,2966,15954,https://i.ytimg.com/vi/2kyS6SvSYSE/default.jpg,False,False,False,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,1ZAPwfrtAFY,17.14.11,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,2017-11-13T07:30:00.000Z,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,https://i.ytimg.com/vi/1ZAPwfrtAFY/default.jpg,False,False,False,"One year after the presidential election, John..."
2,5qpjK5DgCt4,17.14.11,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,2017-11-12T19:05:24.000Z,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,https://i.ytimg.com/vi/5qpjK5DgCt4/default.jpg,False,False,False,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,puqaWrEC7tY,17.14.11,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,https://i.ytimg.com/vi/puqaWrEC7tY/default.jpg,False,False,False,Today we find out if Link is a Nickelback amat...
4,d380meD0W0M,17.14.11,I Dare You: GOING BALD!?,nigahiga,24,2017-11-12T18:01:41.000Z,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,https://i.ytimg.com/vi/d380meD0W0M/default.jpg,False,False,False,I know it's been a while since we did this sho...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23357,pH7VfJDq7f4,18.12.03,Why Bridges Move...,Practical Engineering,27,2018-02-27T12:00:08.000Z,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,https://i.ytimg.com/vi/pH7VfJDq7f4/default.jpg,False,False,False,...and other musings on thermal movement of la...
23358,hV-yHbbrKRA,18.12.03,Macaroni - A Recipe From 1784,Townsends,27,2018-02-26T21:23:39.000Z,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,https://i.ytimg.com/vi/hV-yHbbrKRA/default.jpg,False,False,False,Visit Our Website! ▶ http://www.townsends.us/ ...
23359,CwKp6Xhy3_4,18.12.03,Chris Young - Hangin' On,ChrisYoungVEVO,10,2018-02-26T08:00:02.000Z,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,https://i.ytimg.com/vi/CwKp6Xhy3_4/default.jpg,False,False,False,Chris Young's Hangin' On from his #1 album Los...
23360,vQiiNGllGQo,18.12.03,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,2018-02-26T11:09:32.000Z,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,https://i.ytimg.com/vi/vQiiNGllGQo/default.jpg,False,False,False,very wholesome stuff.\n\nThis video was taken ...
23361,2afSbqlp5HU,18.12.03,How to speak like Black Panther - BBC News,BBC News,1,2018-02-27T12:26:49.000Z,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,https://i.ytimg.com/vi/2afSbqlp5HU/default.jpg,False,False,False,The new marvel film Black Panther is set in th...

In [6]:
newdataset1=dataset.drop(["video_id","thumbnail_link","comments_disabled","ratings_disabled","video_error_or_removed"],axis = 1)

In [7]:
newdataset1

,trending_date,title,channel_title,category_id,publish_time,tags,views,likes,dislikes,comment_count,description
0,17.14.11,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,2017-11-13T17:13:01.000Z,SHANtell martin,748374,57527,2966,15954,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,17.14.11,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,2017-11-13T07:30:00.000Z,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,"One year after the presidential election, John..."
2,17.14.11,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,2017-11-12T19:05:24.000Z,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,17.14.11,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,Today we find out if Link is a Nickelback amat...
4,17.14.11,I Dare You: GOING BALD!?,nigahiga,24,2017-11-12T18:01:41.000Z,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,I know it's been a while since we did this sho...
...,...,...,...,...,...,...,...,...,...,...,...
23357,18.12.03,Why Bridges Move...,Practical Engineering,27,2018-02-27T12:00:08.000Z,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,...and other musings on thermal movement of la...
23358,18.12.03,Macaroni - A Recipe From 1784,Townsends,27,2018-02-26T21:23:39.000Z,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,Visit Our Website! ▶ http://www.townsends.us/ ...
23359,18.12.03,Chris Young - Hangin' On,ChrisYoungVEVO,10,2018-02-26T08:00:02.000Z,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,Chris Young's Hangin' On from his #1 album Los...
23360,18.12.03,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,2018-02-26T11:09:32.000Z,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,very wholesome stuff.\n\nThis video was taken ...
23361,18.12.03,How to speak like Black Panther - BBC News,BBC News,1,2018-02-27T12:26:49.000Z,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,The new marvel film Black Panther is set in th...

In [8]:
newdataset1.to_csv("UsVideosNew.csv",index = False)

In [9]:
excelset = pd.read_excel("excelfile.xlsx")

FileNotFoundError: [Errno 2] No such file or directory: 'excelfile.xlsx'

In [ ]:
excelset

In [10]:
excelset["The Telegraph"] = [1700,8000,3900,2500]

NameError: name 'excelset' is not defined

In [96]:
excelset

  Unnamed: 0  Reuters   BBC   CNN  Al Jazerra  The Telegraph
0    England     1000  5000  9000        1500           1700
1        UAE     2000  6000  1000        1400           8000
2        USA     3000  7000  1100        1500           3900
3      China     4000  8000  1200        1600           2500

In [97]:
excelset.to_excel("excelfilenew.xlsx")

In [103]:
new = pd.read_html("http://www.contextures.com/xlSampleData01.html",header = 0) # <--- mind the header argument

In [104]:
new[0]

     OrderDate   Region       Rep     Item  Units  UnitCost    Total
0     1/6/2020     East     Jones   Pencil     95      1.99   189.05
1    1/23/2020  Central    Kivell   Binder     50     19.99   999.50
2     2/9/2020  Central   Jardine   Pencil     36      4.99   179.64
3    2/26/2020  Central      Gill      Pen     27     19.99   539.73
4    3/15/2020     West   Sorvino   Pencil     56      2.99   167.44
5     4/1/2020     East     Jones   Binder     60      4.99   299.40
6    4/18/2020  Central   Andrews   Pencil     75      1.99   149.25
7     5/5/2020  Central   Jardine   Pencil     90      4.99   449.10
8    5/22/2020     West  Thompson   Pencil     32      1.99    63.68
9     6/8/2020     East     Jones   Binder     60      8.99   539.40
10   6/25/2020  Central    Morgan   Pencil     90      4.99   449.10
11   7/12/2020     East    Howard   Binder     29      1.99    57.71
12   7/29/2020     East    Parent   Binder     81     19.99  1619.19
13   8/15/2020     East     Jones   Pencil     35      4.99   174.65
14    9/1/2020  Central     Smith     Desk      2    125.00   250.00
15   9/18/2020     East     Jones  Pen Set     16     15.99   255.84
16   10/5/2020  Central    Morgan   Binder     28      8.99   251.72
17  10/22/2020     East     Jones      Pen     64      8.99   575.36
18   11/8/2020     East    Parent      Pen     15     19.99   299.85
19  11/25/2020  Central    Kivell  Pen Set     96      4.99   479.04
20  12/12/2020  Central     Smith   Pencil     67      1.29    86.43
21  12/29/2020     East    Parent  Pen Set     74     15.99  1183.26
22   1/15/2021  Central      Gill   Binder     46      8.99   413.54
23    2/1/2021  Central     Smith   Binder     87     15.00  1305.00
24   2/18/2021     East     Jones   Binder      4      4.99    19.96
25    3/7/2021     West   Sorvino   Binder      7     19.99   139.93
26   3/24/2021  Central   Jardine  Pen Set     50      4.99   249.50
27   4/10/2021  Central   Andrews   Pencil     66      1.99   131.34
28   4/27/2021     East    Howard      Pen     96      4.99   479.04
29   5/14/2021  Central      Gill   Pencil     53      1.29    68.37
30   5/31/2021  Central      Gill   Binder     80      8.99   719.20
31   6/17/2021  Central    Kivell     Desk      5    125.00   625.00
32    7/4/2021     East     Jones  Pen Set     62      4.99   309.38
33   7/21/2021  Central    Morgan  Pen Set     55     12.49   686.95
34    8/7/2021  Central    Kivell  Pen Set     42     23.95  1005.90
35   8/24/2021     West   Sorvino     Desk      3    275.00   825.00
36   9/10/2021  Central      Gill   Pencil      7      1.29     9.03
37   9/27/2021     West   Sorvino      Pen     76      1.99   151.24
38  10/14/2021     West  Thompson   Binder     57     19.99  1139.43
39  10/31/2021  Central   Andrews   Pencil     14      1.29    18.06
40  11/17/2021  Central   Jardine   Binder     11      4.99    54.89
41   12/4/2021  Central   Jardine   Binder     94     19.99  1879.06
42  12/21/2021  Central   Andrews   Binder     28      4.99   139.72

In [11]:
df.info()

NameError: name 'df' is not defined

In [12]:
df.describe()

NameError: name 'df' is not defined

#### Example

In [7]:
dataset_dirty = pd.read_csv("Covid19 India.csv")

In [8]:
dataset_dirty

,Sno,Date,State/UnionTerritory,ConfirmedIndianNational,ConfirmedForeignNational,Cured,Deaths
0,1,30-01-2020,Kerala,1,0,0,0
1,2,31-01-2020,Kerala,1,0,0,0
2,3,01-02-2020,Kerala,2,0,0,0
3,4,02-02-2020,Kerala,3,0,0,0
4,5,03-02-2020,Kerala,3,0,0,0
...,...,...,...,...,...,...,...
265,266,21-03-2020,Jammu and Kashmir,4,0,0,0
266,267,21-03-2020,Ladakh,13,0,0,0
267,268,21-03-2020,Uttar Pradesh,23,1,9,0
268,269,21-03-2020,Uttarakhand,3,0,0,0
269,270,21-03-2020,West Bengal,3,0,0,0

In [9]:
dataset_dirty2 = pd.read_csv("Hyper Cars 2019.csv")

In [10]:
dataset_dirty2

,Car Name,Displacement,Enginee,hp,Transmission,Toppp-speeed,Cost
0,McLaren F1,6.100000345,V12,618.0,6.0,243.000,"25, 000, 000"
1,Bugatti Chiron,8,W16,1479.0,7.0,250.000,"3, 000, 000"
2,Mercedes-AMG ONE,1.6,V6,748.0,8.0,217.000,"2, 653, 000"
3,McLaren Sennaaaa,4,V8987654,789.0,NaN,211.000,"1, 500, 000"
4,Koenigseeeggg Agera,5,V8,1016.0,NaN,249.000,"2, 500, 000"
5,Porsche 918 Spyder,Hello,V8,NaN,7.0,211.000,"900, 000"
6,Ferrari LaFerrari,6.3,V12,949.0,7.0,NaN,"2, 000, 000"
7,Pagaaani Huayra BC,6,__,745.0,7.0,230.000,"2, 550, 000"
8,Aston Martin Valkyrie,6.590987865,V12,NaN,NaN,250.000,"3, 200, 000"
9,Bugatti Veyronre,8,W16,987.0,7.0,267.856,"2, 000, 000"

In [11]:
dataset_dirty3 = pd.read_csv("Zynga Stock Prices.csv")

In [12]:
dataset_dirty3

            Date Close/Last     Volume    Open     High     Low
0     03/26/2021     $10.06   14692300   $9.81   $10.07   $9.78
1     03/25/2021      $9.82   20257850  $9.605    $9.83   $9.58
2     03/24/2021      $9.72   20291530     $10   $10.01   $9.67
3     03/23/2021      $9.98   15002050  $10.05   $10.12  $9.865
4     03/22/2021     $10.03   17136270  $10.05   $10.22     $10
...          ...        ...        ...     ...      ...     ...
2328  12/22/2011      $9.47    2985845   $9.65    $9.65   $9.25
2329  12/21/2011      $9.47    5068623   $9.24  $9.5699   $9.15
2330  12/20/2011      $9.24    8357297   $9.15    $9.38   $9.08
2331  12/19/2011      $9.05   18391090    $9.5     $9.6   $8.75
2332  12/16/2011       $9.5  116808300     $11    $11.5      $9

[2333 rows x 6 columns]

In [13]:
dataset_dirty4 = pd.read_csv("unbalanced-sentiment-arabizi-ds.csv")

In [14]:
dataset_dirty4

                                                  tweet sentiment highlight
0     Aw enn l ahla men hek hay li btelbesle crop to...  Negative      None
1     yu2brnee jamelo pepe :p tfeh shu beche3 bas li...  Negative      None
2                                  Lea ktir pedophile 😂  Negative  Bullying
3                                    Shu hal hmar hayda  Negative  Bullying
4     Fasharet 3a ra2btak w ra2bit m3almak w ra2bit ...  Negative      None
...                                                 ...       ...       ...
3129  ntebih lyom ma badna ysir fik metel ma sar bi ...  Negative      None
3130  😔 iza eerfu byentek amali ma tkhalini faker b ...  Negative      None
3131  Ntore ta ya3rfo eno b chaher zyede fi ysir arg...  Negative      None
3132  Khawafetna... 3am netkheyal kif Bekoun lwade3 ...  Negative      None
3133  la wlooooo deymn knt etkheyal hk shi oul no wa...  Negative      None

[3134 rows x 3 columns]

In [6]:
# dirty data example................
dataset = pd.read_csv("marketing_data.csv")

In [14]:
dataset

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Response,Complain,Country
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,0,189,...,6,1,0,0,0,0,0,1,0,SP
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,0,464,...,7,5,0,0,0,0,1,1,0,CA
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,0,134,...,5,2,0,0,0,0,0,0,0,US
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,0,10,...,2,7,0,0,0,0,0,0,0,AUS
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,0,6,...,2,7,1,0,0,0,0,1,0,SP
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10142,1976,PhD,Divorced,"$66,476.00",0,1,3/7/13,99,372,...,11,4,0,0,0,0,0,0,0,US
2236,5263,1977,2n Cycle,Married,"$31,056.00",1,0,1/22/13,99,5,...,3,8,0,0,0,0,0,0,0,SP
2237,22,1976,Graduation,Divorced,"$46,310.00",1,0,12/3/12,99,185,...,5,8,0,0,0,0,0,0,0,SP
2238,528,1978,Graduation,Married,"$65,819.00",0,0,11/29/12,99,267,...,10,3,0,0,0,0,0,0,0,IND
2239,4070,1969,PhD,Married,"$94,871.00",0,2,9/1/12,99,169,...,4,7,0,1,1,0,0,1,0,CA

In [86]:
newdataset=dataset.drop(["ID","Kidhome","Teenhome","AcceptedCmp4","AcceptedCmp1","AcceptedCmp3","AcceptedCmp2","AcceptedCmp5"],axis = 1)

In [87]:
newdataset

,Year_Birth,Education,Marital_Status,Income,Dt_Customer,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain,Country
0,1970,Graduation,Divorced,"$84,835.00",6/16/14,0,189,104,379,111,189,218,1,4,4,6,1,1,0,SP
1,1961,Graduation,Single,"$57,091.00",6/15/14,0,464,5,64,7,0,37,1,7,3,7,5,1,0,CA
2,1958,Graduation,Married,"$67,267.00",5/13/14,0,134,11,59,15,2,30,1,3,2,5,2,0,0,US
3,1967,Graduation,Together,"$32,474.00",5/11/14,0,10,0,1,0,0,0,1,1,0,2,7,0,0,AUS
4,1989,Graduation,Single,"$21,474.00",4/8/14,0,6,16,24,11,0,34,2,3,1,2,7,1,0,SP
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,1976,PhD,Divorced,"$66,476.00",3/7/13,99,372,18,126,47,48,78,2,5,2,11,4,0,0,US
2236,1977,2n Cycle,Married,"$31,056.00",1/22/13,99,5,10,13,3,8,16,1,1,0,3,8,0,0,SP
2237,1976,Graduation,Divorced,"$46,310.00",12/3/12,99,185,2,88,15,5,14,2,6,1,5,8,0,0,SP
2238,1978,Graduation,Married,"$65,819.00",11/29/12,99,267,38,701,149,165,63,1,5,4,10,3,0,0,IND
2239,1969,PhD,Married,"$94,871.00",9/1/12,99,169,24,553,188,0,144,1,8,5,4,7,1,0,CA

In [90]:
newdataset.shape

(2240, 20)

In [18]:
newdataset["NumWebVisitsMonth"].mean()

5.316517857142857

In [21]:
newdataset["NumWebPurchases"].max()

27

In [22]:
newdataset[newdataset["NumWebVisitsMonth"] == newdataset["NumWebVisitsMonth"].max()]

,Year_Birth,Education,Marital_Status,Income,Dt_Customer,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain,Country
1466,1971,Graduation,Divorced,"$1,730.00",5/18/14,65,1,1,3,1,1,1,15,0,0,0,20,0,0,SP
1533,1950,PhD,Together,"$5,648.00",3/13/14,68,28,0,6,1,1,13,1,1,0,0,20,0,0,US
1721,1957,PhD,Together,"$6,835.00",12/8/12,76,107,2,12,2,2,12,0,0,0,1,20,0,0,CA

In [25]:
newdataset[newdataset["NumWebVisitsMonth"] == newdataset["NumWebVisitsMonth"].max()]["Country"]

1466    SP
1533    US
1721    CA
Name: Country, dtype: object

In [91]:
# Example data cleaning ($ etc.)

In [92]:
# Pickle dataset okuma
# Excel sheet okuma (parametre)
# Url okuma
# Sql tablosundan okuma ---------< Zor (MERT)
# Google Analyticsten çekme <---------- (MERT)

In [ ]:
# MEAN, MAX, MEDIAN, ETC.
# AXIS = 0, AXIS = 1 (MEAN OF ROWS, MEAN OF COLUMNS)

In [20]:
dataset[['MntMeatProducts','NumWebPurchases']].mean()

MntMeatProducts    166.950000
NumWebPurchases      4.084821
dtype: float64

In [21]:
dataset[['MntMeatProducts','NumWebPurchases']].mean(axis=0)

MntMeatProducts    166.950000
NumWebPurchases      4.084821
dtype: float64

In [22]:
dataset[['MntMeatProducts','NumWebPurchases']].mean(axis=1)

0       191.5
1        35.5
2        31.0
3         1.0
4        13.5
        ...
2235     65.5
2236      7.0
2237     47.0
2238    353.0
2239    280.5
Length: 2240, dtype: float64

In [19]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4    Income              2216 non-null   object
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Response             2240 non-null   int64
 26  Complain             2240 non-null   int64
 27  Country              2240 non-null   object
dtypes: int64(23), object(5)
memory usage: 490.1+ KB

#### Groupby Operator - (take these to the end, just before merge, join)

In [62]:
dataset = {
        "Sites":["Reuters","BBC","Al Jazerra","Al Jazerra","The Telegraph","BBC"],
        "Location": ["England","UAE","USA","Russia","Germany","China"],
        "Visitor":[2000,500,5500,3000,2000,4500]
        }

In [63]:
dataset

{'Sites': ['Reuters',
  'BBC',
  'Al Jazerra',
  'Al Jazerra',
  'The Telegraph',
  'BBC'],
 'Location': ['England', 'UAE', 'USA', 'Russia', 'Germany', 'China'],
 'Visitor': [2000, 500, 5500, 3000, 2000, 4500]}

In [64]:
df = pd.DataFrame(dataset)

In [65]:
df

           Sites Location  Visitor
0        Reuters  England     2000
1            BBC      UAE      500
2     Al Jazerra      USA     5500
3     Al Jazerra   Russia     3000
4  The Telegraph  Germany     2000
5            BBC    China     4500

In [66]:
Sitegroup = df.groupby("Sites")

In [67]:
Sitegroup

In [68]:
Sitegroup.sum()

               Visitor
Sites
Al Jazerra        8500
BBC               5000
Reuters           2000
The Telegraph     2000

In [69]:
Totalvisitor_Tlgrph = Sitegroup.sum().loc["The Telegraph"]

In [70]:
int(Totalvisitor_Tlgrph)

2000

In [71]:
Totalvisitor_BBC = Sitegroup.sum().loc["BBC"]

In [72]:
int(Totalvisitor_BBC)

5000

In [73]:
df.groupby("Sites").count()

               Location  Visitor
Sites
Al Jazerra            2        2
BBC                   2        2
Reuters               1        1
The Telegraph         1        1

In [74]:
df.groupby("Sites").max() # Sözlükte en son gelen değer geldi Location için

              Location  Visitor
Sites
Al Jazerra         USA     5500
BBC                UAE     4500
Reuters        England     2000
The Telegraph  Germany     2000

In [75]:
#maxvisitor = df.groupby("Sites").Visitor.max()
#maxvisitor

Sites
Al Jazerra       5500
BBC              4500
Reuters          2000
The Telegraph    2000
Name: Visitor, dtype: int64

In [77]:
maxvisitor = df.groupby("Sites")["Visitor"].max() # more faster
maxvisitor

Sites
Al Jazerra       5500
BBC              4500
Reuters          2000
The Telegraph    2000
Name: Visitor, dtype: int64

In [63]:
maxvisitor = df.groupby("Sites").max()["Visitor"]
maxvisitor

Sites
Al Jazerra       5500
BBC              4500
Reuters          2000
The Telegraph    2000
Name: Visitor, dtype: int64

In [80]:
%timeit df.groupby("Sites").max()["Visitor"]

4.77 ms ± 204 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [81]:
%timeit df.groupby("Sites")["Visitor"].max()

1.03 ms ± 6.34 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [61]:
maxvisitor_aljazerra = df.groupby("Sites").max()["Visitor"]["Al Jazerra"]
maxvisitor_aljazerra

5500

In [67]:
averagevisitor = df.groupby("Sites").mean()["Visitor"]
averagevisitor

Sites
Al Jazerra       4250
BBC              2500
Reuters          2000
The Telegraph    2000
Name: Visitor, dtype: int64

In [65]:
averagevisitor_aljazerra = df.groupby("Sites").mean()["Visitor"]["Al Jazerra"]
averagevisitor_aljazerra

4250

### Merge, Join ve Concatenate - (TAKE THESE TO THE END OF THE NOTEBOOK)

#### Concatenation

In [29]:
dataset1 = {
    "Trendyol"   : ["Phone","PC","Jean","Necklace"],
    "N11"        : ["TV","Camera","T-Shirt","Watch"],
    "Hepsiburada": ["PS","X-Box","Printer","Shoe"]
}

In [30]:
dataset2 = {
    "Trendyol"   : ["Headphone","Sweatshirt","Chair","Jacket"],
    "N11"        : ["Bed","Curtain","Mirror","Glass"],
    "Hepsiburada": ["Carpet","Iron","Mug","Bag"]
}

In [31]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4])
df2 = pd.DataFrame(dataset2,index = [5,6,7,8])

In [32]:
df1

   Trendyol      N11 Hepsiburada
1     Phone       TV          PS
2        PC   Camera       X-Box
3      Jean  T-Shirt     Printer
4  Necklace    Watch        Shoe

In [33]:
df2

     Trendyol      N11 Hepsiburada
5   Headphone      Bed      Carpet
6  Sweatshirt  Curtain        Iron
7       Chair   Mirror         Mug
8      Jacket    Glass         Bag

In [34]:
pd.concat([df1,df2])

     Trendyol      N11 Hepsiburada
1       Phone       TV          PS
2          PC   Camera       X-Box
3        Jean  T-Shirt     Printer
4    Necklace    Watch        Shoe
5   Headphone      Bed      Carpet
6  Sweatshirt  Curtain        Iron
7       Chair   Mirror         Mug
8      Jacket    Glass         Bag

In [35]:
pd.concat([df1,df2],axis = 1)

   Trendyol      N11 Hepsiburada    Trendyol      N11 Hepsiburada
1     Phone       TV          PS         NaN      NaN         NaN
2        PC   Camera       X-Box         NaN      NaN         NaN
3      Jean  T-Shirt     Printer         NaN      NaN         NaN
4  Necklace    Watch        Shoe         NaN      NaN         NaN
5       NaN      NaN         NaN   Headphone      Bed      Carpet
6       NaN      NaN         NaN  Sweatshirt  Curtain        Iron
7       NaN      NaN         NaN       Chair   Mirror         Mug
8       NaN      NaN         NaN      Jacket    Glass         Bag

#### Merge

In [58]:
dataset3 = {
    "Trendyol"   : ["Phone","PC","Jean",],
    "N11"        : ["TV","Camera","T-Shirt"],
    "Hepsiburada": ["PS","X-Box","Printer"]
}

In [59]:
dataset4 = {
    "Amazon"      : ["Headphone","Sweatshirt","Chair","Jacket"],
    "Gittigidiyor": ["Bed","Curtain","Mirror","Glass"],
    "Hepsiburada" : ["PS","X-Box","Mug","Bag"]
}

In [60]:
df3 = pd.DataFrame(dataset3,index = [1,2,3])

In [61]:
df4 = pd.DataFrame(dataset4,index = [1,2,3,4])

In [62]:
df3

  Trendyol      N11 Hepsiburada
1    Phone       TV          PS
2       PC   Camera       X-Box
3     Jean  T-Shirt     Printer

In [63]:
df4

       Amazon Gittigidiyor Hepsiburada
1   Headphone          Bed          PS
2  Sweatshirt      Curtain       X-Box
3       Chair       Mirror         Mug
4      Jacket        Glass         Bag

In [66]:
pd.merge(df3,df4,how ="inner",on = "Hepsiburada")

  Trendyol     N11 Hepsiburada      Amazon Gittigidiyor
0    Phone      TV          PS   Headphone          Bed
1       PC  Camera       X-Box  Sweatshirt      Curtain

In [69]:
pd.merge(df3,df4,how ="outer",on = "Hepsiburada") # (2.indexte) İlk olarak df3 valueları listeye yazıldığı ve
                                                  # hepsiburada valuesi eşleşmediği için diğer değerler NaN geldi.

  Trendyol      N11 Hepsiburada      Amazon Gittigidiyor
0    Phone       TV          PS   Headphone          Bed
1       PC   Camera       X-Box  Sweatshirt      Curtain
2     Jean  T-Shirt     Printer         NaN          NaN
3      NaN      NaN         Mug       Chair       Mirror
4      NaN      NaN         Bag      Jacket        Glass

#### Join

In [36]:
dataset5 = {
    "Trendyol": ["Phone","PC","Jean","Necklace"],
    "N11"     : ["TV","Camera","T-Shirt","Watch"]
}

In [37]:
dataset6 = {
    "Gittigidiyor": ["Bed","Curtain","Mirror"],
    "Hepsiburada" : ["PS","X-Box","Mug"]   
}

In [38]:
df5 = pd.DataFrame(dataset5,index = [1,2,3,4]) 
df6 = pd.DataFrame(dataset6,index = [1,2,3])

In [39]:
df5

   Trendyol      N11
1     Phone       TV
2        PC   Camera
3      Jean  T-Shirt
4  Necklace    Watch

In [40]:
df6

  Gittigidiyor Hepsiburada
1          Bed          PS
2      Curtain       X-Box
3       Mirror         Mug

In [41]:
df5.join(df6) # df5 4 indekse sahip olduğu için joinlenen df6nın 4.indexleri NaN olarak geldi.

   Trendyol      N11 Gittigidiyor Hepsiburada
1     Phone       TV          Bed          PS
2        PC   Camera      Curtain       X-Box
3      Jean  T-Shirt       Mirror         Mug
4  Necklace    Watch          NaN         NaN

In [42]:
df6.join(df5) # df6 3 indexe sahip olduğu için df5in 4.indexi buraya gelmiyor.

  Gittigidiyor Hepsiburada Trendyol      N11
1          Bed          PS    Phone       TV
2      Curtain       X-Box       PC   Camera
3       Mirror         Mug     Jean  T-Shirt

# Example

# Next Week

# References